
// вид закупки
export const toPurchMethodDescr = (id:number) =>
    id == 0 ? 'Конкурс ':
        id == 1 ? 'Запрос предложений':
            id == 2 ? 'Запрос котировок':
                id == 3 ? 'Аукцион':
                    id == 4 ? 'Закупка у единственного поставщика':
                        id == 4 ? 'Закупка у субъекта малого предпринимательства' : ' Неведома закупка';


// статус
export const toStateDescr = (id:number) =>
    id == 1 ? 'Подача заявок':
        id == 2 ? 'Процедура завершена':' Неведомый статус';

// ФЗ
export const toLawDescr = (id:number) =>
    id == 0 ? '223-ФЗ':
        id == 1 ? '44-ФЗ':' Неведомый ФЗ';

// ФЗ
export const toCyrDescr = (id:string) =>
    id == 'Руб' ? 'Российский рубль':' Неведома валюта';
